Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
/**
 * \file
 *
 * \brief Component description for MLB
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2018-11-06T08:21:24Z */
#ifndef _SAMV71_MLB_COMPONENT_H_
#define _SAMV71_MLB_COMPONENT_H_
#define _SAMV71_MLB_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMV_SAMV71 MediaLB
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MLB */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define MLB_11287                      /**< (MLB) Module ID */
#define REV_MLB E                      /**< (MLB) Module revision */

/* -------- MLB_MLBC0 : (MLB Offset: 0x00) (R/W 32) MediaLB Control 0 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MLBEN:1;                   /**< bit:      0  MediaLB Enable                           */
    uint32_t :1;                        /**< bit:      1  Reserved */
    uint32_t MLBCLK:3;                  /**< bit:   2..4  MLBCLK (MediaLB clock) Speed Select      */
    uint32_t ZERO:1;                    /**< bit:      5  Must be Written to 0                     */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t MLBLK:1;                   /**< bit:      7  MediaLB Lock Status (read-only)          */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t ASYRETRY:1;                /**< bit:     12  Asynchronous Tx Packet Retry             */
    uint32_t :1;                        /**< bit:     13  Reserved */
    uint32_t CTLRETRY:1;                /**< bit:     14  Control Tx Packet Retry                  */
    uint32_t FCNT:3;                    /**< bit: 15..17  The number of frames per sub-buffer for synchronous channels */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MLBC0_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MLBC0_OFFSET                    (0x00)                                        /**<  (MLB_MLBC0) MediaLB Control 0 Register  Offset */

#define MLB_MLBC0_MLBEN_Pos                 0                                              /**< (MLB_MLBC0) MediaLB Enable Position */
#define MLB_MLBC0_MLBEN_Msk                 (_U_(0x1) << MLB_MLBC0_MLBEN_Pos)              /**< (MLB_MLBC0) MediaLB Enable Mask */
#define MLB_MLBC0_MLBEN                     MLB_MLBC0_MLBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC0_MLBEN_Msk instead */
#define MLB_MLBC0_MLBCLK_Pos                2                                              /**< (MLB_MLBC0) MLBCLK (MediaLB clock) Speed Select Position */
#define MLB_MLBC0_MLBCLK_Msk                (_U_(0x7) << MLB_MLBC0_MLBCLK_Pos)             /**< (MLB_MLBC0) MLBCLK (MediaLB clock) Speed Select Mask */
#define MLB_MLBC0_MLBCLK(value)             (MLB_MLBC0_MLBCLK_Msk & ((value) << MLB_MLBC0_MLBCLK_Pos))
#define   MLB_MLBC0_MLBCLK_256_FS_Val       _U_(0x0)                                       /**< (MLB_MLBC0) 256xFs (for MLBPEN = 0)  */
#define   MLB_MLBC0_MLBCLK_512_FS_Val       _U_(0x1)                                       /**< (MLB_MLBC0) 512xFs (for MLBPEN = 0)  */
#define   MLB_MLBC0_MLBCLK_1024_FS_Val      _U_(0x2)                                       /**< (MLB_MLBC0) 1024xFs (for MLBPEN = 0)  */
#define MLB_MLBC0_MLBCLK_256_FS             (MLB_MLBC0_MLBCLK_256_FS_Val << MLB_MLBC0_MLBCLK_Pos)  /**< (MLB_MLBC0) 256xFs (for MLBPEN = 0) Position  */
#define MLB_MLBC0_MLBCLK_512_FS             (MLB_MLBC0_MLBCLK_512_FS_Val << MLB_MLBC0_MLBCLK_Pos)  /**< (MLB_MLBC0) 512xFs (for MLBPEN = 0) Position  */
#define MLB_MLBC0_MLBCLK_1024_FS            (MLB_MLBC0_MLBCLK_1024_FS_Val << MLB_MLBC0_MLBCLK_Pos)  /**< (MLB_MLBC0) 1024xFs (for MLBPEN = 0) Position  */
#define MLB_MLBC0_ZERO_Pos                  5                                              /**< (MLB_MLBC0) Must be Written to 0 Position */
#define MLB_MLBC0_ZERO_Msk                  (_U_(0x1) << MLB_MLBC0_ZERO_Pos)               /**< (MLB_MLBC0) Must be Written to 0 Mask */
#define MLB_MLBC0_ZERO                      MLB_MLBC0_ZERO_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC0_ZERO_Msk instead */
#define MLB_MLBC0_MLBLK_Pos                 7                                              /**< (MLB_MLBC0) MediaLB Lock Status (read-only) Position */
#define MLB_MLBC0_MLBLK_Msk                 (_U_(0x1) << MLB_MLBC0_MLBLK_Pos)              /**< (MLB_MLBC0) MediaLB Lock Status (read-only) Mask */
#define MLB_MLBC0_MLBLK                     MLB_MLBC0_MLBLK_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC0_MLBLK_Msk instead */
#define MLB_MLBC0_ASYRETRY_Pos              12                                             /**< (MLB_MLBC0) Asynchronous Tx Packet Retry Position */
#define MLB_MLBC0_ASYRETRY_Msk              (_U_(0x1) << MLB_MLBC0_ASYRETRY_Pos)           /**< (MLB_MLBC0) Asynchronous Tx Packet Retry Mask */
#define MLB_MLBC0_ASYRETRY                  MLB_MLBC0_ASYRETRY_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC0_ASYRETRY_Msk instead */
#define MLB_MLBC0_CTLRETRY_Pos              14                                             /**< (MLB_MLBC0) Control Tx Packet Retry Position */
#define MLB_MLBC0_CTLRETRY_Msk              (_U_(0x1) << MLB_MLBC0_CTLRETRY_Pos)           /**< (MLB_MLBC0) Control Tx Packet Retry Mask */
#define MLB_MLBC0_CTLRETRY                  MLB_MLBC0_CTLRETRY_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC0_CTLRETRY_Msk instead */
#define MLB_MLBC0_FCNT_Pos                  15                                             /**< (MLB_MLBC0) The number of frames per sub-buffer for synchronous channels Position */
#define MLB_MLBC0_FCNT_Msk                  (_U_(0x7) << MLB_MLBC0_FCNT_Pos)               /**< (MLB_MLBC0) The number of frames per sub-buffer for synchronous channels Mask */
#define MLB_MLBC0_FCNT(value)               (MLB_MLBC0_FCNT_Msk & ((value) << MLB_MLBC0_FCNT_Pos))
#define   MLB_MLBC0_FCNT_1_FRAME_Val        _U_(0x0)                                       /**< (MLB_MLBC0) 1 frame per sub-buffer (Operation is the same as Standard mode.)  */
#define   MLB_MLBC0_FCNT_2_FRAMES_Val       _U_(0x1)                                       /**< (MLB_MLBC0) 2 frames per sub-buffer  */
#define   MLB_MLBC0_FCNT_4_FRAMES_Val       _U_(0x2)                                       /**< (MLB_MLBC0) 4 frames per sub-buffer  */
#define   MLB_MLBC0_FCNT_8_FRAMES_Val       _U_(0x3)                                       /**< (MLB_MLBC0) 8 frames per sub-buffer  */
#define   MLB_MLBC0_FCNT_16_FRAMES_Val      _U_(0x4)                                       /**< (MLB_MLBC0) 16 frames per sub-buffer  */
#define   MLB_MLBC0_FCNT_32_FRAMES_Val      _U_(0x5)                                       /**< (MLB_MLBC0) 32 frames per sub-buffer  */
#define   MLB_MLBC0_FCNT_64_FRAMES_Val      _U_(0x6)                                       /**< (MLB_MLBC0) 64 frames per sub-buffer  */
#define MLB_MLBC0_FCNT_1_FRAME              (MLB_MLBC0_FCNT_1_FRAME_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 1 frame per sub-buffer (Operation is the same as Standard mode.) Position  */
#define MLB_MLBC0_FCNT_2_FRAMES             (MLB_MLBC0_FCNT_2_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 2 frames per sub-buffer Position  */
#define MLB_MLBC0_FCNT_4_FRAMES             (MLB_MLBC0_FCNT_4_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 4 frames per sub-buffer Position  */
#define MLB_MLBC0_FCNT_8_FRAMES             (MLB_MLBC0_FCNT_8_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 8 frames per sub-buffer Position  */
#define MLB_MLBC0_FCNT_16_FRAMES            (MLB_MLBC0_FCNT_16_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 16 frames per sub-buffer Position  */
#define MLB_MLBC0_FCNT_32_FRAMES            (MLB_MLBC0_FCNT_32_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 32 frames per sub-buffer Position  */
#define MLB_MLBC0_FCNT_64_FRAMES            (MLB_MLBC0_FCNT_64_FRAMES_Val << MLB_MLBC0_FCNT_Pos)  /**< (MLB_MLBC0) 64 frames per sub-buffer Position  */
#define MLB_MLBC0_MASK                      _U_(0x3D0BD)                                   /**< \deprecated (MLB_MLBC0) Register MASK  (Use MLB_MLBC0_Msk instead)  */
#define MLB_MLBC0_Msk                       _U_(0x3D0BD)                                   /**< (MLB_MLBC0) Register Mask  */


/* -------- MLB_MS0 : (MLB Offset: 0x0c) (R/W 32) MediaLB Channel Status 0 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MCS:32;                    /**< bit:  0..31  MediaLB Channel Status [31:0] (cleared by writing a 0) */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MS0_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

