Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
#define MLB_MS0_OFFSET                      (0x0C)                                        /**<  (MLB_MS0) MediaLB Channel Status 0 Register  Offset */

#define MLB_MS0_MCS_Pos                     0                                              /**< (MLB_MS0) MediaLB Channel Status [31:0] (cleared by writing a 0) Position */
#define MLB_MS0_MCS_Msk                     (_U_(0xFFFFFFFF) << MLB_MS0_MCS_Pos)           /**< (MLB_MS0) MediaLB Channel Status [31:0] (cleared by writing a 0) Mask */
#define MLB_MS0_MCS(value)                  (MLB_MS0_MCS_Msk & ((value) << MLB_MS0_MCS_Pos))
#define MLB_MS0_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_MS0) Register MASK  (Use MLB_MS0_Msk instead)  */
#define MLB_MS0_Msk                         _U_(0xFFFFFFFF)                                /**< (MLB_MS0) Register Mask  */


/* -------- MLB_MS1 : (MLB Offset: 0x14) (R/W 32) MediaLB Channel Status1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MCS:32;                    /**< bit:  0..31  MediaLB Channel Status [63:32] (cleared by writing a 0) */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MS1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MS1_OFFSET                      (0x14)                                        /**<  (MLB_MS1) MediaLB Channel Status1 Register  Offset */

#define MLB_MS1_MCS_Pos                     0                                              /**< (MLB_MS1) MediaLB Channel Status [63:32] (cleared by writing a 0) Position */
#define MLB_MS1_MCS_Msk                     (_U_(0xFFFFFFFF) << MLB_MS1_MCS_Pos)           /**< (MLB_MS1) MediaLB Channel Status [63:32] (cleared by writing a 0) Mask */
#define MLB_MS1_MCS(value)                  (MLB_MS1_MCS_Msk & ((value) << MLB_MS1_MCS_Pos))
#define MLB_MS1_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_MS1) Register MASK  (Use MLB_MS1_Msk instead)  */
#define MLB_MS1_Msk                         _U_(0xFFFFFFFF)                                /**< (MLB_MS1) Register Mask  */


/* -------- MLB_MSS : (MLB Offset: 0x20) (R/W 32) MediaLB System Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RSTSYSCMD:1;               /**< bit:      0  Reset System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t LKSYSCMD:1;                /**< bit:      1  Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t ULKSYSCMD:1;               /**< bit:      2  Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t CSSYSCMD:1;                /**< bit:      3  Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t SWSYSCMD:1;                /**< bit:      4  Software System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t SERVREQ:1;                 /**< bit:      5  Service Request Enabled                  */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MSS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MSS_OFFSET                      (0x20)                                        /**<  (MLB_MSS) MediaLB System Status Register  Offset */

#define MLB_MSS_RSTSYSCMD_Pos               0                                              /**< (MLB_MSS) Reset System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_RSTSYSCMD_Msk               (_U_(0x1) << MLB_MSS_RSTSYSCMD_Pos)            /**< (MLB_MSS) Reset System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_RSTSYSCMD                   MLB_MSS_RSTSYSCMD_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_RSTSYSCMD_Msk instead */
#define MLB_MSS_LKSYSCMD_Pos                1                                              /**< (MLB_MSS) Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_LKSYSCMD_Msk                (_U_(0x1) << MLB_MSS_LKSYSCMD_Pos)             /**< (MLB_MSS) Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_LKSYSCMD                    MLB_MSS_LKSYSCMD_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_LKSYSCMD_Msk instead */
#define MLB_MSS_ULKSYSCMD_Pos               2                                              /**< (MLB_MSS) Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_ULKSYSCMD_Msk               (_U_(0x1) << MLB_MSS_ULKSYSCMD_Pos)            /**< (MLB_MSS) Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_ULKSYSCMD                   MLB_MSS_ULKSYSCMD_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_ULKSYSCMD_Msk instead */
#define MLB_MSS_CSSYSCMD_Pos                3                                              /**< (MLB_MSS) Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_CSSYSCMD_Msk                (_U_(0x1) << MLB_MSS_CSSYSCMD_Pos)             /**< (MLB_MSS) Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_CSSYSCMD                    MLB_MSS_CSSYSCMD_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_CSSYSCMD_Msk instead */
#define MLB_MSS_SWSYSCMD_Pos                4                                              /**< (MLB_MSS) Software System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_SWSYSCMD_Msk                (_U_(0x1) << MLB_MSS_SWSYSCMD_Pos)             /**< (MLB_MSS) Software System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_SWSYSCMD                    MLB_MSS_SWSYSCMD_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_SWSYSCMD_Msk instead */
#define MLB_MSS_SERVREQ_Pos                 5                                              /**< (MLB_MSS) Service Request Enabled Position */
#define MLB_MSS_SERVREQ_Msk                 (_U_(0x1) << MLB_MSS_SERVREQ_Pos)              /**< (MLB_MSS) Service Request Enabled Mask */
#define MLB_MSS_SERVREQ                     MLB_MSS_SERVREQ_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MSS_SERVREQ_Msk instead */
#define MLB_MSS_MASK                        _U_(0x3F)                                      /**< \deprecated (MLB_MSS) Register MASK  (Use MLB_MSS_Msk instead)  */
#define MLB_MSS_Msk                         _U_(0x3F)                                      /**< (MLB_MSS) Register Mask  */


/* -------- MLB_MSD : (MLB Offset: 0x24) (R/ 32) MediaLB System Data Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t SD0:8;                     /**< bit:   0..7  System Data (Byte 0)                     */
    uint32_t SD1:8;                     /**< bit:  8..15  System Data (Byte 1)                     */
    uint32_t SD2:8;                     /**< bit: 16..23  System Data (Byte 2)                     */
    uint32_t SD3:8;                     /**< bit: 24..31  System Data (Byte 3)                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MSD_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MSD_OFFSET                      (0x24)                                        /**<  (MLB_MSD) MediaLB System Data Register  Offset */

#define MLB_MSD_SD0_Pos                     0                                              /**< (MLB_MSD) System Data (Byte 0) Position */
#define MLB_MSD_SD0_Msk                     (_U_(0xFF) << MLB_MSD_SD0_Pos)                 /**< (MLB_MSD) System Data (Byte 0) Mask */
#define MLB_MSD_SD0(value)                  (MLB_MSD_SD0_Msk & ((value) << MLB_MSD_SD0_Pos))
#define MLB_MSD_SD1_Pos                     8                                              /**< (MLB_MSD) System Data (Byte 1) Position */
#define MLB_MSD_SD1_Msk                     (_U_(0xFF) << MLB_MSD_SD1_Pos)                 /**< (MLB_MSD) System Data (Byte 1) Mask */
#define MLB_MSD_SD1(value)                  (MLB_MSD_SD1_Msk & ((value) << MLB_MSD_SD1_Pos))
#define MLB_MSD_SD2_Pos                     16                                             /**< (MLB_MSD) System Data (Byte 2) Position */
#define MLB_MSD_SD2_Msk                     (_U_(0xFF) << MLB_MSD_SD2_Pos)                 /**< (MLB_MSD) System Data (Byte 2) Mask */
#define MLB_MSD_SD2(value)                  (MLB_MSD_SD2_Msk & ((value) << MLB_MSD_SD2_Pos))
#define MLB_MSD_SD3_Pos                     24                                             /**< (MLB_MSD) System Data (Byte 3) Position */
#define MLB_MSD_SD3_Msk                     (_U_(0xFF) << MLB_MSD_SD3_Pos)                 /**< (MLB_MSD) System Data (Byte 3) Mask */
#define MLB_MSD_SD3(value)                  (MLB_MSD_SD3_Msk & ((value) << MLB_MSD_SD3_Pos))
#define MLB_MSD_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_MSD) Register MASK  (Use MLB_MSD_Msk instead)  */
#define MLB_MSD_Msk                         _U_(0xFFFFFFFF)                                /**< (MLB_MSD) Register Mask  */


/* -------- MLB_MIEN : (MLB Offset: 0x2c) (R/W 32) MediaLB Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t ISOC_PE:1;                 /**< bit:      0  Isochronous Rx Protocol Error Enable     */
    uint32_t ISOC_BUFO:1;               /**< bit:      1  Isochronous Rx Buffer Overflow Enable    */
    uint32_t :14;                       /**< bit:  2..15  Reserved */
    uint32_t SYNC_PE:1;                 /**< bit:     16  Synchronous Protocol Error Enable        */
    uint32_t ARX_DONE:1;                /**< bit:     17  Asynchronous Rx Done Enable              */
    uint32_t ARX_PE:1;                  /**< bit:     18  Asynchronous Rx Protocol Error Enable    */
    uint32_t ARX_BREAK:1;               /**< bit:     19  Asynchronous Rx Break Enable             */
    uint32_t ATX_DONE:1;                /**< bit:     20  Asynchronous Tx Packet Done Enable       */
    uint32_t ATX_PE:1;                  /**< bit:     21  Asynchronous Tx Protocol Error Enable    */
    uint32_t ATX_BREAK:1;               /**< bit:     22  Asynchronous Tx Break Enable             */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t CRX_DONE:1;                /**< bit:     24  Control Rx Packet Done Enable            */
    uint32_t CRX_PE:1;                  /**< bit:     25  Control Rx Protocol Error Enable         */
    uint32_t CRX_BREAK:1;               /**< bit:     26  Control Rx Break Enable                  */
    uint32_t CTX_DONE:1;                /**< bit:     27  Control Tx Packet Done Enable            */
    uint32_t CTX_PE:1;                  /**< bit:     28  Control Tx Protocol Error Enable         */
    uint32_t CTX_BREAK:1;               /**< bit:     29  Control Tx Break Enable                  */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MIEN_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MIEN_OFFSET                     (0x2C)                                        /**<  (MLB_MIEN) MediaLB Interrupt Enable Register  Offset */

#define MLB_MIEN_ISOC_PE_Pos                0                                              /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ISOC_PE_Msk                (_U_(0x1) << MLB_MIEN_ISOC_PE_Pos)             /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ISOC_PE                    MLB_MIEN_ISOC_PE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ISOC_PE_Msk instead */
#define MLB_MIEN_ISOC_BUFO_Pos              1                                              /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Position */
#define MLB_MIEN_ISOC_BUFO_Msk              (_U_(0x1) << MLB_MIEN_ISOC_BUFO_Pos)           /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Mask */
#define MLB_MIEN_ISOC_BUFO                  MLB_MIEN_ISOC_BUFO_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ISOC_BUFO_Msk instead */
#define MLB_MIEN_SYNC_PE_Pos                16                                             /**< (MLB_MIEN) Synchronous Protocol Error Enable Position */
#define MLB_MIEN_SYNC_PE_Msk                (_U_(0x1) << MLB_MIEN_SYNC_PE_Pos)             /**< (MLB_MIEN) Synchronous Protocol Error Enable Mask */
#define MLB_MIEN_SYNC_PE                    MLB_MIEN_SYNC_PE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_SYNC_PE_Msk instead */
#define MLB_MIEN_ARX_DONE_Pos               17                                             /**< (MLB_MIEN) Asynchronous Rx Done Enable Position */
#define MLB_MIEN_ARX_DONE_Msk               (_U_(0x1) << MLB_MIEN_ARX_DONE_Pos)            /**< (MLB_MIEN) Asynchronous Rx Done Enable Mask */
#define MLB_MIEN_ARX_DONE                   MLB_MIEN_ARX_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ARX_DONE_Msk instead */
#define MLB_MIEN_ARX_PE_Pos                 18                                             /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ARX_PE_Msk                 (_U_(0x1) << MLB_MIEN_ARX_PE_Pos)              /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ARX_PE                     MLB_MIEN_ARX_PE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ARX_PE_Msk instead */
#define MLB_MIEN_ARX_BREAK_Pos              19                                             /**< (MLB_MIEN) Asynchronous Rx Break Enable Position */
#define MLB_MIEN_ARX_BREAK_Msk              (_U_(0x1) << MLB_MIEN_ARX_BREAK_Pos)           /**< (MLB_MIEN) Asynchronous Rx Break Enable Mask */
#define MLB_MIEN_ARX_BREAK                  MLB_MIEN_ARX_BREAK_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ARX_BREAK_Msk instead */
#define MLB_MIEN_ATX_DONE_Pos               20                                             /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Position */
#define MLB_MIEN_ATX_DONE_Msk               (_U_(0x1) << MLB_MIEN_ATX_DONE_Pos)            /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Mask */
#define MLB_MIEN_ATX_DONE                   MLB_MIEN_ATX_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ATX_DONE_Msk instead */
#define MLB_MIEN_ATX_PE_Pos                 21                                             /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Position */
#define MLB_MIEN_ATX_PE_Msk                 (_U_(0x1) << MLB_MIEN_ATX_PE_Pos)              /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Mask */
#define MLB_MIEN_ATX_PE                     MLB_MIEN_ATX_PE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ATX_PE_Msk instead */
#define MLB_MIEN_ATX_BREAK_Pos              22                                             /**< (MLB_MIEN) Asynchronous Tx Break Enable Position */
#define MLB_MIEN_ATX_BREAK_Msk              (_U_(0x1) << MLB_MIEN_ATX_BREAK_Pos)           /**< (MLB_MIEN) Asynchronous Tx Break Enable Mask */
#define MLB_MIEN_ATX_BREAK                  MLB_MIEN_ATX_BREAK_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_ATX_BREAK_Msk instead */
#define MLB_MIEN_CRX_DONE_Pos               24                                             /**< (MLB_MIEN) Control Rx Packet Done Enable Position */
#define MLB_MIEN_CRX_DONE_Msk               (_U_(0x1) << MLB_MIEN_CRX_DONE_Pos)            /**< (MLB_MIEN) Control Rx Packet Done Enable Mask */
#define MLB_MIEN_CRX_DONE                   MLB_MIEN_CRX_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CRX_DONE_Msk instead */
#define MLB_MIEN_CRX_PE_Pos                 25                                             /**< (MLB_MIEN) Control Rx Protocol Error Enable Position */
#define MLB_MIEN_CRX_PE_Msk                 (_U_(0x1) << MLB_MIEN_CRX_PE_Pos)              /**< (MLB_MIEN) Control Rx Protocol Error Enable Mask */
#define MLB_MIEN_CRX_PE                     MLB_MIEN_CRX_PE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CRX_PE_Msk instead */
#define MLB_MIEN_CRX_BREAK_Pos              26                                             /**< (MLB_MIEN) Control Rx Break Enable Position */
#define MLB_MIEN_CRX_BREAK_Msk              (_U_(0x1) << MLB_MIEN_CRX_BREAK_Pos)           /**< (MLB_MIEN) Control Rx Break Enable Mask */
#define MLB_MIEN_CRX_BREAK                  MLB_MIEN_CRX_BREAK_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CRX_BREAK_Msk instead */
#define MLB_MIEN_CTX_DONE_Pos               27                                             /**< (MLB_MIEN) Control Tx Packet Done Enable Position */
#define MLB_MIEN_CTX_DONE_Msk               (_U_(0x1) << MLB_MIEN_CTX_DONE_Pos)            /**< (MLB_MIEN) Control Tx Packet Done Enable Mask */
#define MLB_MIEN_CTX_DONE                   MLB_MIEN_CTX_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CTX_DONE_Msk instead */
#define MLB_MIEN_CTX_PE_Pos                 28                                             /**< (MLB_MIEN) Control Tx Protocol Error Enable Position */
#define MLB_MIEN_CTX_PE_Msk                 (_U_(0x1) << MLB_MIEN_CTX_PE_Pos)              /**< (MLB_MIEN) Control Tx Protocol Error Enable Mask */
#define MLB_MIEN_CTX_PE                     MLB_MIEN_CTX_PE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CTX_PE_Msk instead */
#define MLB_MIEN_CTX_BREAK_Pos              29                                             /**< (MLB_MIEN) Control Tx Break Enable Position */
#define MLB_MIEN_CTX_BREAK_Msk              (_U_(0x1) << MLB_MIEN_CTX_BREAK_Pos)           /**< (MLB_MIEN) Control Tx Break Enable Mask */
#define MLB_MIEN_CTX_BREAK                  MLB_MIEN_CTX_BREAK_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MIEN_CTX_BREAK_Msk instead */
#define MLB_MIEN_MASK                       _U_(0x3F7F0003)                                /**< \deprecated (MLB_MIEN) Register MASK  (Use MLB_MIEN_Msk instead)  */
#define MLB_MIEN_Msk                        _U_(0x3F7F0003)                                /**< (MLB_MIEN) Register Mask  */


/* -------- MLB_MLBC1 : (MLB Offset: 0x3c) (R/W 32) MediaLB Control 1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t LOCK:1;                    /**< bit:      6  MediaLB Lock Error Status (cleared by writing a 0) */
    uint32_t CLKM:1;                    /**< bit:      7  MediaLB Clock Missing Status (cleared by writing a 0) */
    uint32_t NDA:8;                     /**< bit:  8..15  Node Device Address                      */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MLBC1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MLBC1_OFFSET                    (0x3C)                                        /**<  (MLB_MLBC1) MediaLB Control 1 Register  Offset */

#define MLB_MLBC1_LOCK_Pos                  6                                              /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Position */
#define MLB_MLBC1_LOCK_Msk                  (_U_(0x1) << MLB_MLBC1_LOCK_Pos)               /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_LOCK                      MLB_MLBC1_LOCK_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC1_LOCK_Msk instead */
#define MLB_MLBC1_CLKM_Pos                  7                                              /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Position */
#define MLB_MLBC1_CLKM_Msk                  (_U_(0x1) << MLB_MLBC1_CLKM_Pos)               /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_CLKM                      MLB_MLBC1_CLKM_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MLBC1_CLKM_Msk instead */
#define MLB_MLBC1_NDA_Pos                   8                                              /**< (MLB_MLBC1) Node Device Address Position */
#define MLB_MLBC1_NDA_Msk                   (_U_(0xFF) << MLB_MLBC1_NDA_Pos)               /**< (MLB_MLBC1) Node Device Address Mask */
#define MLB_MLBC1_NDA(value)                (MLB_MLBC1_NDA_Msk & ((value) << MLB_MLBC1_NDA_Pos))
#define MLB_MLBC1_MASK                      _U_(0xFFC0)                                    /**< \deprecated (MLB_MLBC1) Register MASK  (Use MLB_MLBC1_Msk instead)  */
#define MLB_MLBC1_Msk                       _U_(0xFFC0)                                    /**< (MLB_MLBC1) Register Mask  */


