Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
/* -------- MLB_HCTL : (MLB Offset: 0x80) (R/W 32) HBI Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RST0:1;                    /**< bit:      0  Address Generation Unit 0 Software Reset */
    uint32_t RST1:1;                    /**< bit:      1  Address Generation Unit 1 Software Reset */
    uint32_t :13;                       /**< bit:  2..14  Reserved */
    uint32_t EN:1;                      /**< bit:     15  HBI Enable                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t RST:2;                     /**< bit:   0..1  Address Generation Unit x Software Reset */
    uint32_t :30;                       /**< bit:  2..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MLB_HCTL_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_HCTL_OFFSET                     (0x80)                                        /**<  (MLB_HCTL) HBI Control Register  Offset */

#define MLB_HCTL_RST0_Pos                   0                                              /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Position */
#define MLB_HCTL_RST0_Msk                   (_U_(0x1) << MLB_HCTL_RST0_Pos)                /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Mask */
#define MLB_HCTL_RST0                       MLB_HCTL_RST0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_HCTL_RST0_Msk instead */
#define MLB_HCTL_RST1_Pos                   1                                              /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Position */
#define MLB_HCTL_RST1_Msk                   (_U_(0x1) << MLB_HCTL_RST1_Pos)                /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Mask */
#define MLB_HCTL_RST1                       MLB_HCTL_RST1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_HCTL_RST1_Msk instead */
#define MLB_HCTL_EN_Pos                     15                                             /**< (MLB_HCTL) HBI Enable Position */
#define MLB_HCTL_EN_Msk                     (_U_(0x1) << MLB_HCTL_EN_Pos)                  /**< (MLB_HCTL) HBI Enable Mask */
#define MLB_HCTL_EN                         MLB_HCTL_EN_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_HCTL_EN_Msk instead */
#define MLB_HCTL_MASK                       _U_(0x8003)                                    /**< \deprecated (MLB_HCTL) Register MASK  (Use MLB_HCTL_Msk instead)  */
#define MLB_HCTL_Msk                        _U_(0x8003)                                    /**< (MLB_HCTL) Register Mask  */

#define MLB_HCTL_RST_Pos                    0                                              /**< (MLB_HCTL Position) Address Generation Unit x Software Reset */
#define MLB_HCTL_RST_Msk                    (_U_(0x3) << MLB_HCTL_RST_Pos)                 /**< (MLB_HCTL Mask) RST */
#define MLB_HCTL_RST(value)                 (MLB_HCTL_RST_Msk & ((value) << MLB_HCTL_RST_Pos))  

/* -------- MLB_HCMR : (MLB Offset: 0x88) (R/W 32) HBI Channel Mask 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHM:32;                    /**< bit:  0..31  Bitwise Channel Mask Bit [31:0]          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_HCMR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_HCMR_OFFSET                     (0x88)                                        /**<  (MLB_HCMR) HBI Channel Mask 0 Register 0  Offset */

#define MLB_HCMR_CHM_Pos                    0                                              /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Position */
#define MLB_HCMR_CHM_Msk                    (_U_(0xFFFFFFFF) << MLB_HCMR_CHM_Pos)          /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Mask */
#define MLB_HCMR_CHM(value)                 (MLB_HCMR_CHM_Msk & ((value) << MLB_HCMR_CHM_Pos))
#define MLB_HCMR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_HCMR) Register MASK  (Use MLB_HCMR_Msk instead)  */
#define MLB_HCMR_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_HCMR) Register Mask  */


/* -------- MLB_HCER : (MLB Offset: 0x90) (R/ 32) HBI Channel Error 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CERR:32;                   /**< bit:  0..31  Bitwise Channel Error Bit [31:0]         */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_HCER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_HCER_OFFSET                     (0x90)                                        /**<  (MLB_HCER) HBI Channel Error 0 Register 0  Offset */

#define MLB_HCER_CERR_Pos                   0                                              /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Position */
#define MLB_HCER_CERR_Msk                   (_U_(0xFFFFFFFF) << MLB_HCER_CERR_Pos)         /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Mask */
#define MLB_HCER_CERR(value)                (MLB_HCER_CERR_Msk & ((value) << MLB_HCER_CERR_Pos))
#define MLB_HCER_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_HCER) Register MASK  (Use MLB_HCER_Msk instead)  */
#define MLB_HCER_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_HCER) Register Mask  */


/* -------- MLB_HCBR : (MLB Offset: 0x98) (R/ 32) HBI Channel Busy 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHB:32;                    /**< bit:  0..31  Bitwise Channel Busy Bit [31:0]          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_HCBR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_HCBR_OFFSET                     (0x98)                                        /**<  (MLB_HCBR) HBI Channel Busy 0 Register 0  Offset */

#define MLB_HCBR_CHB_Pos                    0                                              /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Position */
#define MLB_HCBR_CHB_Msk                    (_U_(0xFFFFFFFF) << MLB_HCBR_CHB_Pos)          /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Mask */
#define MLB_HCBR_CHB(value)                 (MLB_HCBR_CHB_Msk & ((value) << MLB_HCBR_CHB_Pos))
#define MLB_HCBR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_HCBR) Register MASK  (Use MLB_HCBR_Msk instead)  */
#define MLB_HCBR_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_HCBR) Register Mask  */


/* -------- MLB_MDAT : (MLB Offset: 0xc0) (R/W 32) MIF Data 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t DATA:32;                   /**< bit:  0..31  CRT or DBR Data                          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MDAT_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MDAT_OFFSET                     (0xC0)                                        /**<  (MLB_MDAT) MIF Data 0 Register 0  Offset */

#define MLB_MDAT_DATA_Pos                   0                                              /**< (MLB_MDAT) CRT or DBR Data Position */
#define MLB_MDAT_DATA_Msk                   (_U_(0xFFFFFFFF) << MLB_MDAT_DATA_Pos)         /**< (MLB_MDAT) CRT or DBR Data Mask */
#define MLB_MDAT_DATA(value)                (MLB_MDAT_DATA_Msk & ((value) << MLB_MDAT_DATA_Pos))
#define MLB_MDAT_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_MDAT) Register MASK  (Use MLB_MDAT_Msk instead)  */
#define MLB_MDAT_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_MDAT) Register Mask  */


