Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
/* -------- MLB_MDWE : (MLB Offset: 0xd0) (R/W 32) MIF Data Write Enable 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MASK:32;                   /**< bit:  0..31  Bitwise Write Enable for CTR Data - bits[31:0] */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MDWE_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MDWE_OFFSET                     (0xD0)                                        /**<  (MLB_MDWE) MIF Data Write Enable 0 Register 0  Offset */

#define MLB_MDWE_MASK_Pos                   0                                              /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Position */
#define MLB_MDWE_MASK_Msk                   (_U_(0xFFFFFFFF) << MLB_MDWE_MASK_Pos)         /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Mask */
#define MLB_MDWE_MASK(value)                (MLB_MDWE_MASK_Msk & ((value) << MLB_MDWE_MASK_Pos))
#define MLB_MDWE_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_MDWE) Register Mask  */


/* -------- MLB_MCTL : (MLB Offset: 0xe0) (R/W 32) MIF Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t XCMP:1;                    /**< bit:      0  Transfer Complete (Write 0 to Clear)     */
    uint32_t :31;                       /**< bit:  1..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MCTL_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MCTL_OFFSET                     (0xE0)                                        /**<  (MLB_MCTL) MIF Control Register  Offset */

#define MLB_MCTL_XCMP_Pos                   0                                              /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Position */
#define MLB_MCTL_XCMP_Msk                   (_U_(0x1) << MLB_MCTL_XCMP_Pos)                /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Mask */
#define MLB_MCTL_XCMP                       MLB_MCTL_XCMP_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MCTL_XCMP_Msk instead */
#define MLB_MCTL_MASK                       _U_(0x01)                                      /**< \deprecated (MLB_MCTL) Register MASK  (Use MLB_MCTL_Msk instead)  */
#define MLB_MCTL_Msk                        _U_(0x01)                                      /**< (MLB_MCTL) Register Mask  */


/* -------- MLB_MADR : (MLB Offset: 0xe4) (R/W 32) MIF Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t ADDR:14;                   /**< bit:  0..13  CTR or DBR Address                       */
    uint32_t :16;                       /**< bit: 14..29  Reserved */
    uint32_t TB:1;                      /**< bit:     30  Target Location Bit                      */
    uint32_t WNR:1;                     /**< bit:     31  Write-Not-Read Selection                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_MADR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_MADR_OFFSET                     (0xE4)                                        /**<  (MLB_MADR) MIF Address Register  Offset */

#define MLB_MADR_ADDR_Pos                   0                                              /**< (MLB_MADR) CTR or DBR Address Position */
#define MLB_MADR_ADDR_Msk                   (_U_(0x3FFF) << MLB_MADR_ADDR_Pos)             /**< (MLB_MADR) CTR or DBR Address Mask */
#define MLB_MADR_ADDR(value)                (MLB_MADR_ADDR_Msk & ((value) << MLB_MADR_ADDR_Pos))
#define MLB_MADR_TB_Pos                     30                                             /**< (MLB_MADR) Target Location Bit Position */
#define MLB_MADR_TB_Msk                     (_U_(0x1) << MLB_MADR_TB_Pos)                  /**< (MLB_MADR) Target Location Bit Mask */
#define MLB_MADR_TB                         MLB_MADR_TB_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MADR_TB_Msk instead */
#define   MLB_MADR_TB_CTR_Val               _U_(0x0)                                       /**< (MLB_MADR) Selects CTR  */
#define   MLB_MADR_TB_DBR_Val               _U_(0x1)                                       /**< (MLB_MADR) Selects DBR  */
#define MLB_MADR_TB_CTR                     (MLB_MADR_TB_CTR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects CTR Position  */
#define MLB_MADR_TB_DBR                     (MLB_MADR_TB_DBR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects DBR Position  */
#define MLB_MADR_WNR_Pos                    31                                             /**< (MLB_MADR) Write-Not-Read Selection Position */
#define MLB_MADR_WNR_Msk                    (_U_(0x1) << MLB_MADR_WNR_Pos)                 /**< (MLB_MADR) Write-Not-Read Selection Mask */
#define MLB_MADR_WNR                        MLB_MADR_WNR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_MADR_WNR_Msk instead */
#define MLB_MADR_MASK                       _U_(0xC0003FFF)                                /**< \deprecated (MLB_MADR) Register MASK  (Use MLB_MADR_Msk instead)  */
#define MLB_MADR_Msk                        _U_(0xC0003FFF)                                /**< (MLB_MADR) Register Mask  */


/* -------- MLB_ACTL : (MLB Offset: 0x3c0) (R/W 32) AHB Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t SCE:1;                     /**< bit:      0  Software Clear Enable                    */
    uint32_t SMX:1;                     /**< bit:      1  AHB Interrupt Mux Enable                 */
    uint32_t DMA_MODE:1;                /**< bit:      2  DMA Mode                                 */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t MPB:1;                     /**< bit:      4  DMA Packet Buffering Mode                */
    uint32_t :27;                       /**< bit:  5..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_ACTL_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_ACTL_OFFSET                     (0x3C0)                                       /**<  (MLB_ACTL) AHB Control Register  Offset */

