Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
#define MLB_ACTL_SCE_Pos                    0                                              /**< (MLB_ACTL) Software Clear Enable Position */
#define MLB_ACTL_SCE_Msk                    (_U_(0x1) << MLB_ACTL_SCE_Pos)                 /**< (MLB_ACTL) Software Clear Enable Mask */
#define MLB_ACTL_SCE                        MLB_ACTL_SCE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_ACTL_SCE_Msk instead */
#define MLB_ACTL_SMX_Pos                    1                                              /**< (MLB_ACTL) AHB Interrupt Mux Enable Position */
#define MLB_ACTL_SMX_Msk                    (_U_(0x1) << MLB_ACTL_SMX_Pos)                 /**< (MLB_ACTL) AHB Interrupt Mux Enable Mask */
#define MLB_ACTL_SMX                        MLB_ACTL_SMX_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_ACTL_SMX_Msk instead */
#define MLB_ACTL_DMA_MODE_Pos               2                                              /**< (MLB_ACTL) DMA Mode Position */
#define MLB_ACTL_DMA_MODE_Msk               (_U_(0x1) << MLB_ACTL_DMA_MODE_Pos)            /**< (MLB_ACTL) DMA Mode Mask */
#define MLB_ACTL_DMA_MODE                   MLB_ACTL_DMA_MODE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_ACTL_DMA_MODE_Msk instead */
#define MLB_ACTL_MPB_Pos                    4                                              /**< (MLB_ACTL) DMA Packet Buffering Mode Position */
#define MLB_ACTL_MPB_Msk                    (_U_(0x1) << MLB_ACTL_MPB_Pos)                 /**< (MLB_ACTL) DMA Packet Buffering Mode Mask */
#define MLB_ACTL_MPB                        MLB_ACTL_MPB_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MLB_ACTL_MPB_Msk instead */
#define   MLB_ACTL_MPB_SINGLE_PACKET_Val    _U_(0x0)                                       /**< (MLB_ACTL) Single-packet mode  */
#define   MLB_ACTL_MPB_MULTIPLE_PACKET_Val  _U_(0x1)                                       /**< (MLB_ACTL) Multiple-packet mode  */
#define MLB_ACTL_MPB_SINGLE_PACKET          (MLB_ACTL_MPB_SINGLE_PACKET_Val << MLB_ACTL_MPB_Pos)  /**< (MLB_ACTL) Single-packet mode Position  */
#define MLB_ACTL_MPB_MULTIPLE_PACKET        (MLB_ACTL_MPB_MULTIPLE_PACKET_Val << MLB_ACTL_MPB_Pos)  /**< (MLB_ACTL) Multiple-packet mode Position  */
#define MLB_ACTL_MASK                       _U_(0x17)                                      /**< \deprecated (MLB_ACTL) Register MASK  (Use MLB_ACTL_Msk instead)  */
#define MLB_ACTL_Msk                        _U_(0x17)                                      /**< (MLB_ACTL) Register Mask  */


/* -------- MLB_ACSR : (MLB Offset: 0x3d0) (R/W 32) AHB Channel Status 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHS:32;                    /**< bit:  0..31  Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_ACSR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_ACSR_OFFSET                     (0x3D0)                                       /**<  (MLB_ACSR) AHB Channel Status 0 Register 0  Offset */

#define MLB_ACSR_CHS_Pos                    0                                              /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Position */
#define MLB_ACSR_CHS_Msk                    (_U_(0xFFFFFFFF) << MLB_ACSR_CHS_Pos)          /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Mask */
#define MLB_ACSR_CHS(value)                 (MLB_ACSR_CHS_Msk & ((value) << MLB_ACSR_CHS_Pos))
#define MLB_ACSR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_ACSR) Register MASK  (Use MLB_ACSR_Msk instead)  */
#define MLB_ACSR_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_ACSR) Register Mask  */


/* -------- MLB_ACMR : (MLB Offset: 0x3d8) (R/W 32) AHB Channel Mask 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHM:32;                    /**< bit:  0..31  Bitwise Channel Mask Bits 31 to 0        */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MLB_ACMR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MLB_ACMR_OFFSET                     (0x3D8)                                       /**<  (MLB_ACMR) AHB Channel Mask 0 Register 0  Offset */

#define MLB_ACMR_CHM_Pos                    0                                              /**< (MLB_ACMR) Bitwise Channel Mask Bits 31 to 0 Position */
#define MLB_ACMR_CHM_Msk                    (_U_(0xFFFFFFFF) << MLB_ACMR_CHM_Pos)          /**< (MLB_ACMR) Bitwise Channel Mask Bits 31 to 0 Mask */
#define MLB_ACMR_CHM(value)                 (MLB_ACMR_CHM_Msk & ((value) << MLB_ACMR_CHM_Pos))
#define MLB_ACMR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (MLB_ACMR) Register MASK  (Use MLB_ACMR_Msk instead)  */
#define MLB_ACMR_Msk                        _U_(0xFFFFFFFF)                                /**< (MLB_ACMR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief MLB hardware registers */
typedef struct {  
  __IO uint32_t MLB_MLBC0;      /**< (MLB Offset: 0x00) MediaLB Control 0 Register */
  __I  uint8_t                        Reserved1[8];
  __IO uint32_t MLB_MS0;        /**< (MLB Offset: 0x0C) MediaLB Channel Status 0 Register */
  __I  uint8_t                        Reserved2[4];
  __IO uint32_t MLB_MS1;        /**< (MLB Offset: 0x14) MediaLB Channel Status1 Register */
  __I  uint8_t                        Reserved3[8];
  __IO uint32_t MLB_MSS;        /**< (MLB Offset: 0x20) MediaLB System Status Register */
  __I  uint32_t MLB_MSD;        /**< (MLB Offset: 0x24) MediaLB System Data Register */
  __I  uint8_t                        Reserved4[4];
  __IO uint32_t MLB_MIEN;       /**< (MLB Offset: 0x2C) MediaLB Interrupt Enable Register */
  __I  uint8_t                        Reserved5[12];
  __IO uint32_t MLB_MLBC1;      /**< (MLB Offset: 0x3C) MediaLB Control 1 Register */
  __I  uint8_t                        Reserved6[64];
  __IO uint32_t MLB_HCTL;       /**< (MLB Offset: 0x80) HBI Control Register */
  __I  uint8_t                        Reserved7[4];
  __IO uint32_t MLB_HCMR[2];    /**< (MLB Offset: 0x88) HBI Channel Mask 0 Register 0 */
  __I  uint32_t MLB_HCER[2];    /**< (MLB Offset: 0x90) HBI Channel Error 0 Register 0 */
  __I  uint32_t MLB_HCBR[2];    /**< (MLB Offset: 0x98) HBI Channel Busy 0 Register 0 */
  __I  uint8_t                        Reserved8[32];
  __IO uint32_t MLB_MDAT[4];    /**< (MLB Offset: 0xC0) MIF Data 0 Register 0 */
  __IO uint32_t MLB_MDWE[4];    /**< (MLB Offset: 0xD0) MIF Data Write Enable 0 Register 0 */
  __IO uint32_t MLB_MCTL;       /**< (MLB Offset: 0xE0) MIF Control Register */
  __IO uint32_t MLB_MADR;       /**< (MLB Offset: 0xE4) MIF Address Register */
  __I  uint8_t                        Reserved9[728];
  __IO uint32_t MLB_ACTL;       /**< (MLB Offset: 0x3C0) AHB Control Register */
  __I  uint8_t                        Reserved10[12];
  __IO uint32_t MLB_ACSR[2];    /**< (MLB Offset: 0x3D0) AHB Channel Status 0 Register 0 */
  __IO uint32_t MLB_ACMR[2];    /**< (MLB Offset: 0x3D8) AHB Channel Mask 0 Register 0 */
} Mlb;

