Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mlb.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief MLB hardware registers */
typedef struct {  
  __IO MLB_MLBC0_Type                 MLB_MLBC0;      /**< Offset: 0x00 (R/W  32) MediaLB Control 0 Register */
  __I  uint8_t                        Reserved1[8];
  __IO MLB_MS0_Type                   MLB_MS0;        /**< Offset: 0x0C (R/W  32) MediaLB Channel Status 0 Register */
  __I  uint8_t                        Reserved2[4];
  __IO MLB_MS1_Type                   MLB_MS1;        /**< Offset: 0x14 (R/W  32) MediaLB Channel Status1 Register */
  __I  uint8_t                        Reserved3[8];
  __IO MLB_MSS_Type                   MLB_MSS;        /**< Offset: 0x20 (R/W  32) MediaLB System Status Register */
  __I  MLB_MSD_Type                   MLB_MSD;        /**< Offset: 0x24 (R/   32) MediaLB System Data Register */
  __I  uint8_t                        Reserved4[4];
  __IO MLB_MIEN_Type                  MLB_MIEN;       /**< Offset: 0x2C (R/W  32) MediaLB Interrupt Enable Register */
  __I  uint8_t                        Reserved5[12];
  __IO MLB_MLBC1_Type                 MLB_MLBC1;      /**< Offset: 0x3C (R/W  32) MediaLB Control 1 Register */
  __I  uint8_t                        Reserved6[64];
  __IO MLB_HCTL_Type                  MLB_HCTL;       /**< Offset: 0x80 (R/W  32) HBI Control Register */
  __I  uint8_t                        Reserved7[4];
  __IO MLB_HCMR_Type                  MLB_HCMR[2];    /**< Offset: 0x88 (R/W  32) HBI Channel Mask 0 Register 0 */
  __I  MLB_HCER_Type                  MLB_HCER[2];    /**< Offset: 0x90 (R/   32) HBI Channel Error 0 Register 0 */
  __I  MLB_HCBR_Type                  MLB_HCBR[2];    /**< Offset: 0x98 (R/   32) HBI Channel Busy 0 Register 0 */
  __I  uint8_t                        Reserved8[32];
  __IO MLB_MDAT_Type                  MLB_MDAT[4];    /**< Offset: 0xC0 (R/W  32) MIF Data 0 Register 0 */
  __IO MLB_MDWE_Type                  MLB_MDWE[4];    /**< Offset: 0xD0 (R/W  32) MIF Data Write Enable 0 Register 0 */
  __IO MLB_MCTL_Type                  MLB_MCTL;       /**< Offset: 0xE0 (R/W  32) MIF Control Register */
  __IO MLB_MADR_Type                  MLB_MADR;       /**< Offset: 0xE4 (R/W  32) MIF Address Register */
  __I  uint8_t                        Reserved9[728];
  __IO MLB_ACTL_Type                  MLB_ACTL;       /**< Offset: 0x3C0 (R/W  32) AHB Control Register */
  __I  uint8_t                        Reserved10[12];
  __IO MLB_ACSR_Type                  MLB_ACSR[2];    /**< Offset: 0x3D0 (R/W  32) AHB Channel Status 0 Register 0 */
  __IO MLB_ACMR_Type                  MLB_ACMR[2];    /**< Offset: 0x3D8 (R/W  32) AHB Channel Mask 0 Register 0 */
} Mlb;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of MediaLB */

#endif /* _SAMV71_MLB_COMPONENT_H_ */
